       IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE2.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT IN-EMPLOYEE-FILE ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT OUT-SALARY-FILE ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD IN-EMPLOYEE-FILE
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 80 CHARACTERS
           VALUE OF FILE-ID IS "INPUT.TXT"
           DATA RECORD IS IN-EMPLOYEE-REC.
       01 IN-EMPLOYEE-REC.
           05 IN-EMPLOYEE-NAME    PIC X(20).
           05 IN-SALARY           PIC 9(5).
           05 IN-NO-OF-DEPENDENTS PIC 9.
           05 IN-STATE-TAX        PIC 9(4)V99.
       FD OUT-SALARY-FILE
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 80 CHARACTERS
           VALUE OF FILE-ID IS "OUTPUT.TXT"
           DATA RECORD IS OUT-SALARY-REC.
       01 OUT-SALARY-REC.
           05 OUT-EMPLOYEE-NAME PIC X(20).
           05 FILLER            PIC X(5).
           05 OUT-SALARY        PIC $$(2),$(3).99.
           05 FILLER            PIC X(5).
           05 OUT-STATE-TAX     PIC $Z(3)9.99.
       WORKING-STORAGE SECTION.
       01 WS-WORK-AREAS.
           05 ARE-THERE-MORE-RECORDS PIC X(3) VALUE 'YES'.
       PROCEDURE DIVISION.
       100-MAIN-MODULE.
           OPEN INPUT IN-EMPLOYEE-FILE
               OUTPUT OUT-SALARY-FILE.

           READ IN-EMPLOYEE-FILE
               AT END MOVE 'NO' TO ARE-THERE-MORE-RECORDS.

           PERFORM 200-CALC-RTN UNTIL ARE-THERE-MORE-RECORDS = 'NO'.
          
           CLOSE IN-EMPLOYEE-FILE
                 OUT-SALARY-FILE.

           STOP RUN.

        200-CALC-RTN.
            MOVE SPACES TO OUT-SALARY-REC.
            MOVE IN-EMPLOYEE-NAME TO OUT-EMPLOYEE-NAME.
            MOVE IN-SALARY TO OUT-SALARY.
            MOVE IN-STATE-TAX TO OUT-STATE-TAX.
            WRITE OUT-SALARY-REC.
            READ IN-EMPLOYEE-FILE 
                AT END MOVE 'NO' TO ARE-THERE-MORE-RECORDS.